RT-Thread/rt-thread/bsp/nuvoton/libraries/nuc980/rtt_port/drv_usbhost.c
        retry--;
    }

    return (retry > 0) ? 0 : -1;
}

static int nu_int_xfer(
    upipe_t pipe,
    S_NU_PORT_DEV *psPortDev,
    UTR_T *psUTR,
    int timeouts)
{
    int ret;

    while (1)
    {
        ret = usbh_int_xfer(psUTR);
        if (ret < 0)
            return ret;

       if (rt_completion_wait(&(psPortDev->utr_completion), timeouts) != 0)
        {
            RT_DEBUG_LOG(RT_DEBUG_USB, ("Request %08x Timeout in %d ms!!\n", psUTR, timeouts));
            usbh_quit_utr(psUTR);

            rt_completion_init(&(psPortDev->utr_completion));
            rt_thread_mdelay(1);
        }
        else
        {

            RT_DEBUG_LOG(RT_DEBUG_USB, ("Transferring done %08x\n", psUTR));
            usbh_quit_utr(psUTR);
            break;
        }
    }

    return 0;
}

static void xfer_done_cb(UTR_T *psUTR)
{
    S_NU_PORT_DEV *psPortDev = (S_NU_PORT_DEV *)psUTR->context;

    //transfer done, signal utr_completion
    rt_completion_done(&(psPortDev->utr_completion));
}

static int nu_pipe_xfer(upipe_t pipe, rt_uint8_t token, void *buffer, int nbytes, int timeouts)
{
    S_NU_RH_PORT_CTRL *psPortCtrl;
    S_NU_PORT_DEV *psPortDev;
    UTR_T *psUTR = NULL;
    int i32XferLen = -1;

    void *buffer_nonch = buffer;

    NU_USBHOST_LOCK();

    psPortCtrl = GetRHPortControlFromPipe(pipe);
    if (psPortCtrl == RT_NULL)
    {
        goto exit_nu_pipe_xfer;
    }

    psPortDev = GetPortDevFromPipe(pipe);
    if (psPortDev->pUDev == NULL)
    {
        RT_DEBUG_LOG(RT_DEBUG_USB, ("nu_pipe_xfer ERROR: udev not found\n"));
        goto exit_nu_pipe_xfer;
    }

#if defined(BSP_USING_MMU)
    if (buffer_nonch && nbytes)
    {
        buffer_nonch = psPortDev->asPipePktBuf[pipe->pipe_index];
        if ((pipe->ep.bEndpointAddress & USB_DIR_MASK) == USB_DIR_OUT)
        {
            rt_memcpy(buffer_nonch, buffer, nbytes);
        }
    }
#endif

    //ctrl xfer
    if (pipe->ep.bmAttributes == USB_EP_ATTR_CONTROL)
    {
        int ret;

        if (token == USBH_PID_SETUP)
        {
            struct urequest *psSetup = (struct urequest *)buffer_nonch;
            RT_ASSERT(buffer_nonch != RT_NULL);
            psPortCtrl->asHubPortDev->u32SentLength[pipe->pipe_index] = 0;

            /* Read data from USB device. */
            if (psSetup->request_type & USB_REQ_TYPE_DIR_IN)
            {
                //Store setup request
                rt_memcpy(&psPortCtrl->asHubPortDev->asSetupReq[pipe->pipe_index], psSetup, sizeof(struct urequest));
            }
            else
            {
                /* Write data to USB device. */
                //Trigger USBHostLib Ctrl_Xfer
                ret = nu_ctrl_xfer(psPortDev, psSetup, NULL, timeouts);
                if (ret != psSetup->wLength)
                    goto exit_nu_pipe_xfer;
            }
        }
        else
        {
            //token == USBH_PID_DATA
            if (buffer_nonch && ((pipe->ep.bEndpointAddress & USB_DIR_MASK) == USB_DIR_IN))
            {
                struct urequest *psSetup = &psPortCtrl->asHubPortDev->asSetupReq[pipe->pipe_index];

                /* Read data from USB device. */
                //Trigger USBHostLib Ctril_Xfer
                /*
                * Workaround: HCD driver can readback all bytes of setup.wLength, but not support single packet transferring.
                */
                if (psPortCtrl->asHubPortDev->u32SentLength[pipe->pipe_index] == 0)
                {
                    ret = nu_ctrl_xfer(psPortDev, psSetup, buffer_nonch, timeouts);
                    psPortCtrl->asHubPortDev->u32SentLength[pipe->pipe_index] = ret;
                    if (ret > 0)
                    {
                        rt_memcpy(buffer, buffer_nonch, ret);
                    }
                }
                else
                {
                    if (psPortCtrl->asHubPortDev->u32SentLength[pipe->pipe_index] < nbytes)
                    {
                        ret = 0;
                    }
                    else
                    {
                        psPortCtrl->asHubPortDev->u32SentLength[pipe->pipe_index] -= nbytes;
                        ret = nbytes;
                    }
                }
                if (ret <= 0)
                    goto exit_nu_pipe_xfer;
            }
            else
            {
                RT_DEBUG_LOG(RT_DEBUG_USB, ("%d == USBH_PID_DATA, nil buf-%d \n", token, nbytes));
            }

        } //else
        i32XferLen = nbytes;
        goto exit_nu_pipe_xfer2;
    } // if ( pipe->ep.bmAttributes == USB_EP_ATTR_CONTROL )
    else
    {

        psUTR = alloc_utr(psPortDev->pUDev);

        if (!psUTR)
        {
            RT_DEBUG_LOG(RT_DEBUG_USB, ("nu_pipe_xfer ERROR: unable alloc UTR\n"));
            goto exit_nu_pipe_xfer;
        }

        psUTR->ep = psPortDev->apsEPInfo[pipe->pipe_index];
        psUTR->buff = buffer_nonch;
        psUTR->data_len = nbytes;
        psUTR->xfer_len = 0;
        psUTR->func = xfer_done_cb;
        psUTR->context = psPortDev;
        psUTR->bIsTransferDone = 0;
        psUTR->status = 0;

        //others xfer
        rt_completion_init(&(psPortDev->utr_completion));

        if (pipe->ep.bmAttributes == USB_EP_ATTR_BULK)
        {
            if (nu_bulk_xfer(psPortDev, psUTR, timeouts) < 0)
            {
                RT_DEBUG_LOG(RT_DEBUG_USB, ("nu_pipe_xfer ERROR: bulk transfer failed\n"));
                goto failreport_nu_pipe_xfer;
            }
        }
        else if (pipe->ep.bmAttributes == USB_EP_ATTR_INT)
        {
            if (nu_int_xfer(pipe, psPortDev, psUTR, timeouts) < 0)
            {
                RT_DEBUG_LOG(RT_DEBUG_USB, ("nu_pipe_xfer ERROR: int transfer failed\n"));
                //goto exit_nu_pipe_xfer;
            }
            else
            {
                i32XferLen = nbytes;
            }
            goto exit_nu_pipe_xfer;
        }
        else if (pipe->ep.bmAttributes == USB_EP_ATTR_ISOC)
        {
            //TODO: ISO transfer
            RT_DEBUG_LOG(RT_DEBUG_USB, ("nu_pipe_xfer ERROR: isoc transfer not support\n"));
            goto exit_nu_pipe_xfer;
        }

    } //else

failreport_nu_pipe_xfer:

